{
  "last_updated": "2025-09-29T19:42:03.579097",
  "publications": [
    {
      "title": "A Sagnac-based arbitrary time-bin state encoder for quantum communication applications",
      "authors": [
        "Kannan Vijayadharan",
        "Matías Rubén Bolaños",
        "Marco Avesani",
        "Giuseppe Vallone",
        "Paolo Villoresi",
        "Costantino Agnesi"
      ],
      "journal": "",
      "year": 2025,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2506.08971",
      "url": "https://arxiv.org/abs/2506.08971",
      "abstract": "Time-bin encoding of quantum information is highly advantageous for long-distance quantum communication protocols over optical fibres due to its inherent robustness in the channel and the possibility of generating high-dimensional quantum states. The most common implementation of time-bin quantum states using unbalanced interferometers presents challenges in terms of stability and flexibility of operation. In particular, a limited number of states can be generated without modifying the optical scheme. Here we present the implementation of a fully controllable arbitrary time-bin quantum state encoder, which is easily scalable to arbitrary dimensions and time-bin widths. The encoder presents high stability and low quantum bit error rate QBER, even at high speeds of operation. Additionally, we demonstrate phase randomization and phase encoding without additional resources.",
      "type": "preprint",
      "venue": "arXiv",
      "pdf_url": "https://arxiv.org/pdf/2506.08971.pdf",
      "bibtex": ""
    },
    {
      "title": "Finite-temperature criticality through quantum annealing",
      "authors": [
        "Gianluca Teza",
        "Francesco Campaioli",
        "Marco Avesani",
        "Oren Raz"
      ],
      "journal": "",
      "year": 2025,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2507.07167",
      "url": "https://arxiv.org/abs/2507.07167",
      "abstract": "Critical phenomena at finite temperature underpin a broad range of physical systems, yet their study remains challenging due to computational bottlenecks near phase transitions. Quantum annealers have attracted significant interest as a potential tool for accessing finite temperature criticality beyond classical reach, but their utility in precisely resolving criticality has remained limited by noise, hardware constraints, and thermal fluctuations. Here we overcome these challenges, showing that careful calibration and embedding allow quantum annealers to capture the full finite-temperature critical behavior of the paradigmatic two-dimensional Ising ferromagnet. By tuning the energy scale of the system and mitigating device asymmetries, we sample effective Boltzmann distributions and extract both the critical temperature and the associated critical exponents. Our approach opens the study of equilibrium and non-equilibrium critical phenomena in a broad class of systems at finite temperature.",
      "type": "preprint",
      "venue": "arXiv",
      "pdf_url": "https://arxiv.org/pdf/2507.07167.pdf",
      "bibtex": ""
    },
    {
      "title": "High-Performance Heterodyne Receiver for Quantum Information Processing in a Laser Written Integrated Photonic Platform",
      "authors": [
        "Andrea Peri",
        "Giulio Gualandi",
        "Tommaso Bertapelle",
        "Mattia Sabatini",
        "Giacomo Corrielli",
        "Yoann Piétri",
        "Davide Giacomo Marangon",
        "Giuseppe Vallone",
        "Paolo Villoresi",
        "Roberto Osellame",
        "Marco Avesani"
      ],
      "journal": "",
      "year": 2025,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2506.08924",
      "url": "https://arxiv.org/abs/2506.08924",
      "abstract": "Continuous-Variable Quantum Key Distribution (CV-QKD) and Quantum Random Number Generation (CV-QRNG) are critical technologies for secure communication and high-speed randomness generation, exploiting shot-noise-limited coherent detection for their operation. Integrated photonic solutions are key to advancing these protocols, as they enable compact, scalable, and efficient system implementations. In this work, we introduce Femtosecond Laser Micromachining (FLM) on borosilicate glass as a novel platform for producing Photonic Integrated Circuits (PICs) realizing coherent detection suitable for quantum information processing. We exploit the specific features of FLM to produce a PIC designed for CV-QKD and CV-QRNG applications. The PIC features fully adjustable optical components that achieve precise calibration and reliable operation under protocol-defined conditions. The device exhibits low insertion losses ($\\leq 1.28$ dB), polarization-insensitive operation, and a Common-Mode Rejection Ratio (CMRR) exceeding 73 dB. These characteristics allowed the experimental realization of a source-device-independent CV-QRNG with a secure generation rate of 42.74 Gbps and a QPSK-based CV-QKD system achieving a secret key rate of 3.2 Mbit/s. Our results highlight the potential of FLM technology as an integrated photonic platform, paving the way for scalable and high-performing quantum communication systems.",
      "type": "preprint",
      "venue": "arXiv",
      "pdf_url": "https://arxiv.org/pdf/2506.08924.pdf",
      "bibtex": ""
    },
    {
      "title": "Power-consumption Backdoor in Quantum Key Distribution",
      "authors": [
        "Beatriz Lopes da Costa",
        "Matías R. Bolaños",
        "Ricardo Chaves",
        "Claudio Narduzzi",
        "Marco Avesani",
        "Davide Giacomo Marangon",
        "Andrea Stanco",
        "Giuseppe Vallone",
        "Paolo Villoresi",
        "Yasser Omar"
      ],
      "journal": "",
      "year": 2025,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2503.11767",
      "url": "https://arxiv.org/abs/2503.11767",
      "abstract": "Over the last decades, Quantum Key Distribution (QKD) has risen as a promising solution for secure communications. However, like all cryptographic protocols, QKD implementations can open security vulnerabilities. Until now, the study of physical vulnerabilities in QKD setups has primarily focused on the optical channel. In classical cryptoanalysis, power and electromagnetic side-channel analysis are powerful techniques used to access unwanted information about the encryption key in symmetric-key algorithms. In QKD they have rarely been used, since they require an eavesdropper to have access to Alice or Bob's setups. However, security proofs of QKD protocols generally assume that these setups are secure, making it crucial to understand the necessary security measures to ensure this protection. In this work, we propose and implement a power side-channel analysis to a QKD system, by exploiting the power consumption of the electronic driver controlling the electro-optical components of the QKD transmitter. QKD modules typically require very precise electronic drivers, such as Field Programmable Gate Arrays (FPGAs). Here, we show that the FPGA's power consumption can leak information about the QKD operation, and consequently the transmitted key. The analysis was performed on the QKD transmitter at the University of Padua. Our results are consistent and show critical information leakage, having reached a maximum accuracy of 73.35% in predicting transmitted qubits at a 100 MHz repetition frequency.",
      "type": "preprint",
      "venue": "arXiv",
      "pdf_url": "https://arxiv.org/pdf/2503.11767.pdf",
      "bibtex": ""
    },
    {
      "title": "Quantum bounds and device-independent security with rank-one qubit measurements",
      "authors": [
        "Lorenzo Coccia",
        "Matteo Padovan",
        "Andrea Pompermaier",
        "Mattia Sabatini",
        "Marco Avesani",
        "Davide Giacomo Marangon",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "",
      "year": 2025,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2503.13282",
      "url": "https://arxiv.org/abs/2503.13282",
      "abstract": "Device-independent (DI) quantum protocols exploit Bell inequality violations to ensure security or certify quantum properties without making assumptions about the internal workings of the devices. In this work, we study the role of rank-one qubit positive operator-valued measures (POVMs) in DI scenarios. This class includes all qubit extremal POVMs, i.e., those measurements that cannot be realized by randomly choosing among others, as well as part of non-extremal POVMs, which have recently been shown to be useful for security applications in sequential quantum protocols. We demonstrate that any rank-one POVM can generate correlations in bipartite scenarios that saturate a Tsirelson inequality, i.e., a quantum bound on linear combinations of outcome statistics, when the two parties share an arbitrary entangled two-qubit state and some other self-tested measurements are performed. For extremal POVMs, such saturation allows for an explicit calculation of the guessing probability and the worst-case conditional von Neumann entropy. From the Tsirelson inequality, we establish a randomness certification method that facilitates numerical simulations and noise analysis. To test its feasibility, we performed a proof-of-concept experiment employing a three-outcome POVM on tilted entangled states under experimental non-idealities. We further explore the case of non-extremal POVMs, providing insights into their role in DI protocols.",
      "type": "preprint",
      "venue": "arXiv",
      "pdf_url": "https://arxiv.org/pdf/2503.13282.pdf",
      "bibtex": ""
    },
    {
      "title": "Versatile Wavelength-Division Multiplexed Quantum Key Distribution Network Operating Simultaneously in the O and C Bands",
      "authors": [
        "Davide Scalcon",
        "Matteo Padovan",
        "Paolo Villoresi",
        "Giuseppe Vallone",
        "Marco Avesani"
      ],
      "journal": "",
      "year": 2025,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2507.11175",
      "url": "https://arxiv.org/abs/2507.11175",
      "abstract": "Ongoing technological progress is accelerating the commercial and global-scale deployment of Quantum Key Distribution (QKD). Its ability to enable unconditionally secure communication is expected to be a key feature of future telecommunication networks, and practical demonstrations of QKD network implementations in real-world environments are crucial for ensuring reliable adoption. In this work, we demonstrate a four-node photonic QKD network that employs versatile and cost-effective wavelength-division multiplexing across three transmitters in the O and C bands to simultaneously distribute quantum-secure keys among all nodes. Specifically, the broadband central receiver node shares all optical and electronic decoding components, except for the single-photon detectors, across the three QKD links, significantly reducing system costs and enhancing compactness.",
      "type": "preprint",
      "venue": "arXiv",
      "pdf_url": "https://arxiv.org/pdf/2507.11175.pdf",
      "bibtex": ""
    },
    {
      "title": "Hybrid encoder for discrete and continuous variable QKD",
      "authors": [
        "Mattia Sabatini",
        "Tommaso Bertapelle",
        "Paolo Villoresi",
        "Giuseppe Vallone",
        "Marco Avesani"
      ],
      "journal": "Adv Quantum Technol. 2025, 2400522",
      "year": 2024,
      "volume": "",
      "pages": "",
      "doi": "10.1002/qute.202400522",
      "arxiv_id": "2408.17412",
      "url": "https://arxiv.org/abs/2408.17412",
      "abstract": "Quantum key distribution (QKD) is emerging as a cutting-edge application of quantum technology, gradually integrating into the industrial landscape. Many protocols employing discrete or continuous variables have been developed over time. Whereas the firsts usually excel in covering longer distances, the seconds are typically superior in producing higher secret key rates at short distances. Present efforts aim to create systems that can exploit both these strengths, foreseeing the future challenge regarding the realization of a quantum network consisting of multiple and heterogeneous interconnected nodes. Within such a context, a possible solution are devices able to efficiently toggle between discrete and continuous variable working modes with hybrid quantum state encoders. Therefore, this study presents a new hybrid encoder based on an iPOGNAC modulator, ensuring compatibility with Discrete Variable (DV) and Continuous Variable (CV) QKD systems that can be assembled entirely with commercial-off-the-shelf components. The proposed scheme is the first supporting DV polarization protocols, thus making it an appealing candidate for space nodes of a future quantum network, given that polarization-based protocols are well suited for space links.",
      "type": "journal",
      "venue": "Adv Quantum Technol. 2025, 2400522",
      "pdf_url": "https://arxiv.org/pdf/2408.17412.pdf",
      "bibtex": ""
    },
    {
      "title": "High-speed Source-Device-Independent Quantum Random Number Generator on a Chip",
      "authors": [
        "Tommaso Bertapelle",
        "Marco Avesani",
        "Alberto Santamato",
        "Alberto Montanaro",
        "Marco Chiesa",
        "Davide Rotta",
        "Massimo Artiglia",
        "Vito Sorianello",
        "Francesco Testa",
        "Gabriele De Angelis",
        "Giampiero Contestabile",
        "Giuseppe Vallone",
        "Marco Romagnoli",
        "Paolo Villoresi"
      ],
      "journal": "Optica Quantum 3, 111-118 (2025)",
      "year": 2023,
      "volume": "",
      "pages": "",
      "doi": "10.1364/OPTICAQ.529746",
      "arxiv_id": "2305.12472",
      "url": "https://arxiv.org/abs/2305.12472",
      "abstract": "A wide range of applications require, by hypothesis, to have access to a high-speed, private, and genuine random source. Quantum Random Number Generators (QRNGs) are currently the sole technology capable of producing true randomness. However, the bulkiness of current implementations significantly limits their adoption. In this work, we present a high-performance source-device independent QRNG leveraging a custom made integrated photonic chip. The proposed scheme exploits the properties of a heterodyne receiver to enhance security and integration to promote spatial footprint reduction while simplifying its implementation. This characteristics could represents a significant advancement toward the development of generators better suited to meet the demands of portable and space applications. The system can deliver secure random numbers at a rate greater than 20 Gbps with a reduced spatial and power footprint.",
      "type": "journal",
      "venue": "Optica Quantum 3, 111-118 (2025)",
      "pdf_url": "https://arxiv.org/pdf/2305.12472.pdf",
      "bibtex": ""
    },
    {
      "title": "Intermodal quantum key distribution field trial with active switching between fiber and free-space channels",
      "authors": [
        "Francesco Picciariello",
        "Ilektra Karakosta-Amarantidou",
        "Edoardo Rossi",
        "Marco Avesani",
        "Giulio Foletto",
        "Luca Calderaro",
        "Giuseppe Vallone",
        "Paolo Villoresi",
        "Francesco Vedovato"
      ],
      "journal": "EPJ Quantum Technol. 12, 6 (2025)",
      "year": 2023,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2310.17441",
      "url": "https://arxiv.org/abs/2310.17441",
      "abstract": "Intermodal quantum key distribution enables the full interoperability of fiber networks and free-space channels, which are both necessary elements for the development of a global quantum network. We present a field trial of an intermodal quantum key distribution system in a simple 3-node heterogeneous quantum network - comprised of two polarization-based transmitters and a single receiver - in which the active channel is alternately switched between a free-space link of 620 m and a 17km-long deployed fiber in the metropolitan area of Padova. The performance of the free-space channel is evaluated against the atmospheric turbulence strength of the link. The field trial lasted for several hours in daylight conditions, attesting the interoperability between fiber and free-space channels, with a secret key rate of the order of kbps for both the channels. The QKD hardware and software require no different strategies to work over the two channels, even if the intrinsic characteristics of the links are clearly different. The switching system represents a cost-effective solution for a trusted quantum key distribution network, reducing the number of necessary devices in different network topologies.",
      "type": "journal",
      "venue": "EPJ Quantum Technol. 12, 6 (2025)",
      "pdf_url": "https://arxiv.org/pdf/2310.17441.pdf",
      "bibtex": ""
    },
    {
      "title": "International time transfer between precise timing facilities secured with a quantum key distribution network",
      "authors": [
        "Francesco Picciariello",
        "Francesco Vedovato",
        "Davide Orsucci",
        "Pablo Nahuel Dominguez",
        "Thomas Zechel",
        "Marco Avesani",
        "Matteo Padovan",
        "Giulio Foletto",
        "Luca Calderaro",
        "Daniele Dequal",
        "Amita Shrestha",
        "Ludwig Blumel",
        "Johann Furthner",
        "Giuseppe Vallone",
        "Paolo Villoresi",
        "Tobias D. Schmidt",
        "Florian Moll"
      ],
      "journal": "GPS solutions 28, 48 (2024)",
      "year": 2023,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2305.01554",
      "url": "https://arxiv.org/abs/2305.01554",
      "abstract": "Global Navigation Satellite Systems (GNSSs), such as GPS and Galileo, provide precise time and space coordinates globally and constitute part of the critical infrastructure of modern society. To reliably operate GNSS, a highly accurate and stable system time is required, such as the one provided by several independent clocks hosted in Precise Timing Facilities (PTFs) around the world. Periodically, the relative clock offset between PTFs is measured to have a fallback system to synchronize the GNSS satellite clocks. The security and integrity of the communication between PTFs is of paramount importance: if compromised, it could lead to disruptions to the GNSS service. Therefore, it is a compelling use-case for protection via Quantum Key Distribution (QKD), since this technology provides information-theoretic security. We have performed a field trial demonstration of such use-case by sharing encrypted time synchronization information between two PTFs, one located in Oberpfaffenhofen (Germany) and one in Matera (Italy) - more than 900km apart as the crow flies. To bridge this large distance, a satellite-QKD system is required, plus a \"last-mile\" terrestrial link to connect the optical ground station (OGS) to the actual location of the PTF. In our demonstration we have deployed two full QKD systems to protect the last-mile connection at both the locations and have shown via simulation that upcoming QKD satellites will be able to distribute keys between Oberpfaffenhofen and Matera exploiting already existing OGSs.",
      "type": "journal",
      "venue": "GPS solutions 28, 48 (2024)",
      "pdf_url": "https://arxiv.org/pdf/2305.01554.pdf",
      "bibtex": ""
    },
    {
      "title": "Low-error encoder for time-bin and decoy states for quantum key distribution",
      "authors": [
        "Davide Scalcon",
        "Elisa Bazzani",
        "Giuseppe Vallone",
        "Paolo Villoresi",
        "Marco Avesani"
      ],
      "journal": "npj Quantum Information 11, 22 (2025)",
      "year": 2023,
      "volume": "",
      "pages": "",
      "doi": "10.1038/s41534-024-00923-9",
      "arxiv_id": "2311.02059",
      "url": "https://arxiv.org/abs/2311.02059",
      "abstract": "Time-bin encoding has been widely used for implementing quantum key distribution (QKD) on optical fiber channels due to its robustness with respect to drifts introduced by the optical fiber. However, due to the use of interferometric structures, achieving stable and low intrinsic Quantum Bit Error rate (QBER) in time-bin systems can be challenging. A key device for decoy-state prepare & measure QKD is represented by the state encoder, that must generate low-error and stable states with different values of mean photon number. Here we propose the MacZac (Mach-Zehder-Sagnac), a time-bin encoder with ultra-low intrinsic QBER (<2e-5) and high stability. The device is based on nested Sagnac and Mach-Zehnder interferometers and uses a single phase modulator for both decoy and state preparation, greatly simplifying the optical setup. The encoder does not require any active compensation or feedback system and it can be scaled for the generation of states with arbitrary dimension. We experimentally realized and tested the device performances as a stand alone component and in a complete QKD experiments. Thanks to the capacity to combine extremely low QBER, high stability and experimental simplicity the proposed device can be used as a key building block for future high-performance, low-cost QKD systems.",
      "type": "journal",
      "venue": "npj Quantum Information 11, 22 (2025)",
      "pdf_url": "https://arxiv.org/pdf/2311.02059.pdf",
      "bibtex": ""
    },
    {
      "title": "Modular source for near-infrared quantum communication",
      "authors": [
        "Federico Berra",
        "Costantino Agnesi",
        "Andrea Stanco",
        "Marco Avesani",
        "Sebastiano Cocchi",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "EPJ Quantum Technol. 10, 27 (2023)",
      "year": 2023,
      "volume": "",
      "pages": "",
      "doi": "10.1140/epjqt/s40507-023-00185-y",
      "arxiv_id": "2301.12882",
      "url": "https://arxiv.org/abs/2301.12882",
      "abstract": "We present a source of states for Quantum Key Distribution (QKD) based on a modular design exploiting the iPOGNAC, a stable, low-error, and calibration-free polarization modulation scheme, for both intensity and polarization encoding. This source is immune to the security vulnerabilities of other state sources such as side channels and some quantum hacking attacks. Furthermore, our intensity modulation scheme allows full tunability of the intensity ratio between the decoy and signal states, and mitigates patterning effects. The source was implemented and tested at the near-infrared optical band around 800 nm, of particular interest for satellite-based QKD. Remarkably, the modularity of the source simplifies its development, testing, and qualification, especially for space missions. For these reasons, our work paves the way for the development of the second generation of QKD satellites that can guarantee excellent performances at higher security levels.",
      "type": "journal",
      "venue": "EPJ Quantum Technol. 10, 27 (2023)",
      "pdf_url": "https://arxiv.org/pdf/2301.12882.pdf",
      "bibtex": ""
    },
    {
      "title": "Secure and robust randomness with sequential quantum measurements",
      "authors": [
        "Matteo Padovan",
        "Giulio Foletto",
        "Lorenzo Coccia",
        "Marco Avesani",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "npj Quantum Information 10, 94 (2024)",
      "year": 2023,
      "volume": "",
      "pages": "",
      "doi": "10.1038/s41534-024-00879-w",
      "arxiv_id": "2309.12286",
      "url": "https://arxiv.org/abs/2309.12286",
      "abstract": "Quantum correlations between measurements of separated observers are crucial for applications like randomness generation and key distribution. Although device-independent security can be certified with minimal assumptions, current protocols have limited performances. Here, we exploit sequential measurements, defined with a precise temporal order, to enhance performances by reusing quantum states. We provide a geometric perspective and a general mathematical framework, analytically proving a Tsirelson-like boundary for sequential quantum correlations, which represents a trade-off in nonlocality shared by sequential users. This boundary is advantageous for secure quantum randomness generation, certifying maximum bits per state with one remote and two sequential parties, even if one sequential user shares no nonlocality. Our simple qubit protocol reaches this boundary, and numerical analysis shows improved robustness under realistic noise. A photonic implementation confirms feasibility and robustness. This study advances understanding of sequential quantum correlations and offers insights for efficient device-independent protocols.",
      "type": "journal",
      "venue": "npj Quantum Information 10, 94 (2024)",
      "pdf_url": "https://arxiv.org/pdf/2309.12286.pdf",
      "bibtex": ""
    },
    {
      "title": "Synchronization of quantum communication over an optical classical communication channel",
      "authors": [
        "Federico Berra",
        "Costantino Agnesi",
        "Andrea Stanco",
        "Marco Avesani",
        "Michal Kuklewski",
        "Daniel Matter",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "Applied Optics 62, 7994 (2023)",
      "year": 2023,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2306.17603",
      "url": "https://arxiv.org/abs/2306.17603",
      "abstract": "Precise synchronization between transmitter and receiver is crucial for quantum communication protocols, such as Quantum Key Distribution (QKD), to efficiently correlate the transmitted and received signals and increase the signal-to-noise ratio. In this work, we introduce a synchronization technique that exploits a co-propagating classical optical communication link and test its performance in a free-space QKD system. Previously, existing techniques required additional laser beams or relied on the capability of retrieving the synchronization from the quantum signal itself, though this is not applicable in high channel loss scenarios. On the contrary, our method exploits classical and quantum signals locked to the same master clock, allowing the receiver to synchronize both the classical and quantum communication links by performing a clock-data-recovery routine on the classical signal. In this way, by exploiting the same classical communication already required for post-processing and key generation, no additional hardware is required, and the synchronization can be reconstructed from a high-power signal. Our approach is suitable for both satellite and fiber infrastructures, where a classical and quantum channel can be transmitted through the same link.",
      "type": "journal",
      "venue": "Applied Optics 62, 7994 (2023)",
      "pdf_url": "https://arxiv.org/pdf/2306.17603.pdf",
      "bibtex": ""
    },
    {
      "title": "Synchronization of quantum communications over an optical classical communications channel",
      "authors": [
        "Federico Berra",
        "Costantino Agnesi",
        "Andrea Stanco",
        "Marco Avesani",
        "Michal Kuklewski",
        "Daniel Matter",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Applied Optics",
      "year": 2023,
      "volume": "",
      "pages": "",
      "doi": "10.1364/AO.500416",
      "arxiv_id": "",
      "url": "https://doi.org/10.1364/AO.500416",
      "abstract": "",
      "type": "journal",
      "venue": "Applied Optics",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "Cross‐Encoded Quantum Key Distribution Exploiting Time‐Bin and Polarization States with Qubit‐Based Synchronization",
      "authors": [
        "Davide Scalcon",
        "Costantino Agnesi",
        "Marco Avesani",
        "Luca Calderaro",
        "Giulio Foletto",
        "Andrea Stanco",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Advanced Quantum Technologies",
      "year": 2022,
      "volume": "",
      "pages": "",
      "doi": "10.1002/qute.202200051",
      "arxiv_id": "",
      "url": "https://doi.org/10.1002/qute.202200051",
      "abstract": "",
      "type": "journal",
      "venue": "Advanced Quantum Technologies",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "QUANGO: a CubeSat platform for quantum key distribution and 5G IoT connectivity service",
      "authors": [],
      "journal": "",
      "year": 2022,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "",
      "url": "",
      "abstract": "",
      "type": "conference",
      "venue": "",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "Cross-encoded quantum key distribution exploiting time-bin and polarization states with qubit-based synchronization",
      "authors": [
        "Davide Scalcon",
        "Costantino Agnesi",
        "Marco Avesani",
        "Luca Calderaro",
        "Giulio Foletto",
        "Andrea Stanco",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Adv. Quantum Tech 2200051 (2022)",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2111.13383",
      "url": "https://arxiv.org/abs/2111.13383",
      "abstract": "Robust implementation of quantum key distribution requires precise state generation and measurements, as well as a transmission that is resistant to channel disturbances. However, the choice of the optimal encoding scheme is not trivial and depends on external factors such as the quantum channel. In fact, stable and low-error encoders are available for polarization encoding, suitable for free-space channels, whereas time-bin encoding represent a good candidate for fiber-optic channels, as birefingence does not perturb this kind of states. Here we present a cross-encoded scheme where high accuracy quantum states are prepared through a self-compensating, calibration-free polarization modulator and transmitted using a polarization-to-time-bin converter. A hybrid receiver performs both time-of-arrival and polarization measurements to decode the quantum states and successfully leaded to a transmission over 50 km fiber spool without disturbances. Temporal synchronization between the two parties is performed with a qubit-based method that does not require additional hardware to share a clock reference. The system was tested in a 12 hour run and demonstrated good and stable performance in terms of key and quantum bit error rates. The flexibility of our approach represents an important step towards the development of hybrid networks with both fiber-optic and free-space links.",
      "type": "journal",
      "venue": "Adv. Quantum Tech 2200051 (2022)",
      "pdf_url": "https://arxiv.org/pdf/2111.13383.pdf",
      "bibtex": ""
    },
    {
      "title": "Deployment-ready quantum key distribution over a classical network infrastructure in Padua",
      "authors": [
        "Marco Avesani",
        "Giulio Foletto",
        "Matteo Padovan",
        "Luca Calderaro",
        "Costantino Agnesi",
        "Elisa Bazzani",
        "Federico Berra",
        "Tommaso Bertapelle",
        "Francesco Picciariello",
        "Francesco B. L. Santagiustina",
        "Davide Scalcon",
        "Alessia Scriminich",
        "Andrea Stanco",
        "Francesco Vedovato",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Journal of Lightwave Technology 40 (6), 1658 - 1663 (2022)",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "10.1109/JLT.2021.3130447",
      "arxiv_id": "2109.13558",
      "url": "https://arxiv.org/abs/2109.13558",
      "abstract": "Current technological progress is driving Quantum Key Distribution towards a commercial and world widescale expansion. Its capability to deliver unconditionally secure communication will be a fundamental feature in the next generations of telecommunication networks. Nevertheless, demonstrations of QKD implementation in a real operating scenario and their coexistence with the classical telecom infrastructure are of fundamental importance for reliable exploitation. Here we present a Quantum Key Distribution application implemented overa classical fiber-based infrastructure. By exploiting just a single fiber cable for both the quantum and the classical channel and by using a simplified receiver scheme with just one single-photon detector, we demonstrate the feasibility of low-cost and ready-to-use Quantum Key Distribution systems compatible with standard classical infrastructure.",
      "type": "journal",
      "venue": "Journal of Lightwave Technology 40 (6), 1658 - 1663 (2022)",
      "pdf_url": "https://arxiv.org/pdf/2109.13558.pdf",
      "bibtex": ""
    },
    {
      "title": "Experimental Test of Sequential Weak Measurements for Certified Quantum Randomness Extraction",
      "authors": [
        "Giulio Foletto",
        "Matteo Padovan",
        "Marco Avesani",
        "Hamid Tebyanian",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "Phys. Rev. A 103, 062206 (2021)",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "10.1103/PhysRevA.103.062206",
      "arxiv_id": "2101.12074",
      "url": "https://arxiv.org/abs/2101.12074",
      "abstract": "Quantum nonlocality offers a secure way to produce random numbers: their unpredictability is intrinsic and can be certified just by observing the statistic of the measurement outcomes, without assumptions on how they are produced. To do this, entangled pairs are generated and measured to violate a Bell inequality with the outcome statistics. However, after a projective quantum measurement, entanglement is entirely destroyed and cannot be used again. This fact poses an upper bound to the number of random numbers that can be produced from each quantum state when projective measurements are employed. Instead, by using weak measurements, some entanglement can be maintained and reutilized, and a sequence of weak measurements can extract an unbounded amount of randomness from a single state as predicted in Phys. Rev. A 95, 020102(R) (2017). We study the feasibility of these weak measurements, analyze the robustness to imperfections in the quantum state they are applied to, and then test them using an optical setup based on polarization-entangled photon pairs. We show that the weak measurements are realizable, but can improve the performance of randomness generation only in close-to-ideal conditions.",
      "type": "journal",
      "venue": "Phys. Rev. A 103, 062206 (2021)",
      "pdf_url": "https://arxiv.org/pdf/2101.12074.pdf",
      "bibtex": ""
    },
    {
      "title": "Full daylight quantum-key-distribution at 1550 nm enabled by integrated silicon photonics",
      "authors": [
        "M. Avesani",
        "L. Calderaro",
        "M. Schiavon",
        "A. Stanco",
        "C. Agnesi",
        "A. Santamato",
        "M. Zahidy",
        "A. Scriminich",
        "G. Foletto",
        "G. Contestabile",
        "M. Chiesa",
        "D. Rotta",
        "M. Artiglia",
        "A. Montanaro",
        "M. Romagnoli",
        "V. Sorianello",
        "F. Vedovato",
        "G. Vallone",
        "P. Villoresi"
      ],
      "journal": "npj Quantum Information",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "10.1038/s41534-021-00421-2",
      "arxiv_id": "",
      "url": "https://doi.org/10.1038/s41534-021-00421-2",
      "abstract": "",
      "type": "journal",
      "venue": "npj Quantum Information",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "Practical Semi-Device Independent Randomness Generation Based on Quantum State's Indistinguishability",
      "authors": [
        "Hamid Tebyanian",
        "Mujtaba Zahidy",
        "Marco Avesani",
        "Andrea Stanco",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "Quantum Sci. Technol. 6, 045026 (2021)",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2104.11137",
      "url": "https://arxiv.org/abs/2104.11137",
      "abstract": "Semi-device independent (Semi-DI) quantum random number generators (QRNG) gained attention for security applications, offering an excellent trade-off between security and generation rate. This paper presents a proof-of-principle time-bin encoding semi-DI QRNG experiments based on a prepare-and-measure scheme. The protocol requires two simple assumptions and a measurable condition: an upper-bound on the prepared pulses' energy. We lower-bound the conditional min-entropy from the energy-bound and the input-output correlation, determining the amount of genuine randomness that can be certified. Moreover, we present a generalized optimization problem for bounding the min-entropy in the case of multiple-input and outcomes in the form of a semidefinite program (SDP). The protocol is tested with a simple experimental setup, capable of realizing two configurations for the ternary time-bin encoding scheme. The experimental setup is easy-to-implement and comprises commercially available off-the-shelf (COTS) components at the telecom wavelength, granting a secure and certifiable entropy source. The combination of ease-of-implementation, scalability, high-security level, and output-entropy make our system a promising candidate for commercial QRNGs.",
      "type": "journal",
      "venue": "Quantum Sci. Technol. 6, 045026 (2021)",
      "pdf_url": "https://arxiv.org/pdf/2104.11137.pdf",
      "bibtex": ""
    },
    {
      "title": "Resource-effective quantum key distribution: a field trial in Padua city center",
      "authors": [
        "Marco Avesani",
        "Luca Calderaro",
        "Giulio Foletto",
        "Costantino Agnesi",
        "Francesco Picciariello",
        "Francesco B. L. Santagiustina",
        "Alessia Scriminich",
        "Andrea Stanco",
        "Francesco Vedovato",
        "Mujtaba Zahidy",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Optics Letters",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "10.1364/OL.422890",
      "arxiv_id": "",
      "url": "https://doi.org/10.1364/OL.422890",
      "abstract": "",
      "type": "journal",
      "venue": "Optics Letters",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "Semi-device independent randomness generation based on quantum state’s indistinguishability",
      "authors": [
        "Hamid Tebyanian",
        "Mujtaba Zahidy",
        "Marco Avesani",
        "Andrea Stanco",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "Quantum Science and Technology",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "10.1088/2058-9565/ac2047",
      "arxiv_id": "",
      "url": "https://doi.org/10.1088/2058-9565/ac2047",
      "abstract": "",
      "type": "journal",
      "venue": "Quantum Science and Technology",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "Semi-Device-Independent Heterodyne-Based Quantum Random-Number Generator",
      "authors": [
        "Marco Avesani",
        "Hamid Tebyanian",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "Physical Review Applied",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "10.1103/PhysRevApplied.15.034034",
      "arxiv_id": "",
      "url": "https://doi.org/10.1103/PhysRevApplied.15.034034",
      "abstract": "",
      "type": "journal",
      "venue": "Physical Review Applied",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "Semi-device-independent randomness from d -outcome continuous-variable detection",
      "authors": [
        "Hamid Tebyanian",
        "Marco Avesani",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Physical Review A",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "10.1103/PhysRevA.104.062424",
      "arxiv_id": "",
      "url": "https://doi.org/10.1103/PhysRevA.104.062424",
      "abstract": "",
      "type": "journal",
      "venue": "Physical Review A",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "Versatile and concurrent FPGA-based architecture for practical quantum communication systems",
      "authors": [
        "Andrea Stanco",
        "Francesco B. L. Santagiustina",
        "Luca Calderaro",
        "Marco Avesani",
        "Tommaso Bertapelle",
        "Daniele Dequal",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "IEEE Transactions on Quantum Engineering, vol. 3, pp. 1-8, 2022,\n  Art no. 6000108",
      "year": 2021,
      "volume": "",
      "pages": "",
      "doi": "10.1109/TQE.2022.3143997",
      "arxiv_id": "2107.01857",
      "url": "https://arxiv.org/abs/2107.01857",
      "abstract": "This work presents a hardware and software architecture which can be used in those systems that implement practical Quantum Key Distribution (QKD) and Quantum Random Number Generation (QRNG) schemes. This architecture fully exploits the capability of a System-on-a-Chip (SoC) which comprehends both a Field Programmable Gate Array (FPGA) and a dual core CPU unit. By assigning the time-related tasks to the FPGA and the management to the CPU, we built a flexible system with optimized resource sharing on a commercial off-the-shelf (COTS) evaluation board which includes a SoC. Furthermore, by changing the dataflow direction, the versatile system architecture can be exploited as a QKD transmitter, QKD receiver and QRNG control-acquiring unit. Finally, we exploited the dual core functionality and realized a concurrent stream device to implement a practical QKD transmitter where one core continuously receives fresh data at a sustained rate from an external QRNG source while the other operates with the FPGA to drive the qubits transmission to the QKD receiver. The system was successfully tested on a long-term run proving its stability and security. This demonstration paves the way towards a more secure QKD implementation, with fully unconditional security as the QKD states are entirely generated by a true random process and not by deterministic expansion algorithms. Eventually, this enables the realization of a standalone quantum transmitter, including both the random numbers and the qubits generation.",
      "type": "journal",
      "venue": "IEEE Transactions on Quantum Engineering, vol. 3, pp. 1-8, 2022,\n  Art no. 6000108",
      "pdf_url": "https://arxiv.org/pdf/2107.01857.pdf",
      "bibtex": ""
    },
    {
      "title": "Resource-effective Quantum Key Distribution: a field-trial in Padua city center",
      "authors": [
        "Marco Avesani",
        "Luca Calderaro",
        "Giulio Foletto",
        "Costantino Agnesi",
        "Francesco Picciariello",
        "Francesco Santagiustina",
        "Alessia Scriminich",
        "Andrea Stanco",
        "Francesco Vedovato",
        "Mujtaba Zahidy",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Optics Letters 46, 2848 (2021)",
      "year": 2020,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2012.08457",
      "url": "https://arxiv.org/abs/2012.08457",
      "abstract": "Field-trials are of key importance for novel technologies seeking commercialization and wide-spread adoption. This is certainly also the case for Quantum Key Distribution (QKD), which allows distant parties to distill a secret key with unconditional security. Typically, QKD demonstrations over urban infrastructures require complex stabilization and synchronization systems to maintain a low Quantum Bit Error (QBER) and high secret key rates over time. Here we present a field-trial which exploits a low-complexity self-stabilized hardware and a novel synchronization technique, to perform QKD over optical fibers deployed in the city center of Padua, Italy. In particular, two techniques recently introduced by our research group are evaluated in a real-world environment: the iPOGNAC polarization encoder was used for the preparation of the quantum states, while the temporal synchronization was performed using the Qubit4Sync algorithm. The results here presented demonstrate the validity and robustness of our resource-effective QKD system, that can be easily and rapidly installed in an existing telecommunication infrastructure, thus representing an important step towards mature, efficient and low-cost QKD systems.",
      "type": "journal",
      "venue": "Optics Letters 46, 2848 (2021)",
      "pdf_url": "https://arxiv.org/pdf/2012.08457.pdf",
      "bibtex": ""
    },
    {
      "title": "Semi-device independent randomness from d-outcome continuous-variable detection",
      "authors": [
        "Hamid Tebyanian",
        "Marco Avesani",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Phys. Rev. A 104, 062424 (2021)",
      "year": 2020,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2009.08897",
      "url": "https://arxiv.org/abs/2009.08897",
      "abstract": "Recently, semi-device independent protocols have attracted increasing attention, guaranteeing security with few hypotheses and experimental simplicity. In this paper, we demonstrate a many-outcomes scheme with the binary phase-shift keying (BPSK) for a semi-device independent protocol based on the energy assumption. We show in theory that the number of certified random bits of the d-outcomes system outperforms the standard scheme (binary-outcomes). Furthermore, we compare the results of two well-known measurement schemes, homodyne and heterodyne detection. Lastly, taking into account the experimental imperfections, we discuss the experimental feasibility of the d-outcome design.",
      "type": "journal",
      "venue": "Phys. Rev. A 104, 062424 (2021)",
      "pdf_url": "https://arxiv.org/pdf/2009.08897.pdf",
      "bibtex": ""
    },
    {
      "title": "Semi-Device-Independent Heterodyne-based Quantum Random Number Generator",
      "authors": [
        "Marco Avesani",
        "Hamid Tebyanian",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "Phys. Rev. Applied 15, 034034 (2021)",
      "year": 2020,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2004.08344",
      "url": "https://arxiv.org/abs/2004.08344",
      "abstract": "Randomness is a fundamental feature of quantum mechanics, which is an invaluable resource for both classical and quantum technologies. Practical quantum random number generators (QRNG) usually need to trust their devices, but their security can be jeopardized in case of imperfections or malicious external actions. In this work, we present a robust implementation of a Semi-Device-Independent QRNG that guarantees both security and fast generation rates. The system works in a prepare and measure scenario where measurement and source are untrusted, but a bound on the energy of the prepared states is assumed. Our implementation exploits heterodyne detection, which offers increased generation rate and improved long-term stability compared to alternative measurement strategies. In particular, due to the tomographic properties of heterodyne measurement, we can compensate for fast phase fluctuations via post-processing, avoiding complex active phase stabilization systems. As a result, our scheme combines high security and speed with a simple setup featuring only commercial-off-the-shelf components, making it an attractive solution in many practical scenarios.",
      "type": "journal",
      "venue": "Phys. Rev. Applied 15, 034034 (2021)",
      "pdf_url": "https://arxiv.org/pdf/2004.08344.pdf",
      "bibtex": ""
    },
    {
      "title": "Stable, low-error and calibration-free polarization encoder for free-space quantum communication",
      "authors": [
        "Marco Avesani",
        "Costantino Agnesi",
        "Andrea Stanco",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Optics Letters Vol. 45, Issue 17, pp. 4706-4709 (2020)",
      "year": 2020,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "2004.11877",
      "url": "https://arxiv.org/abs/2004.11877",
      "abstract": "Polarization-encoded free-space Quantum Communication requires a quantum state source featuring fast polarization modulation, long-term stability and a low intrinsic error rate. Here we present a source based on a Sagnac interferometer and composed of polarization maintaining fibers, a fiber polarization beam splitter and an electro-optic phase modulator. The system generates predetermined polarization states with a fixed reference frame in free-space that does not require calibration neither at the transmitter nor at the receiver. In this way we achieve long-term stability and low error rates. A proof-of-concept experiment is also reported, demonstrating a Quantum Bit Error Rate lower than 0.2% for several hours without any active recalibration of the devices.",
      "type": "journal",
      "venue": "Optics Letters Vol. 45, Issue 17, pp. 4706-4709 (2020)",
      "pdf_url": "https://arxiv.org/pdf/2004.11877.pdf",
      "bibtex": ""
    },
    {
      "title": "Stable, low-error, and calibration-free polarization encoder for free-space quantum communication",
      "authors": [
        "Marco Avesani",
        "Costantino Agnesi",
        "Andrea Stanco",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Optics Letters",
      "year": 2020,
      "volume": "",
      "pages": "",
      "doi": "10.1364/OL.396412",
      "arxiv_id": "",
      "url": "https://doi.org/10.1364/OL.396412",
      "abstract": "",
      "type": "journal",
      "venue": "Optics Letters",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "Unbounded randomness from uncharacterized sources",
      "authors": [
        "Marco Avesani",
        "Hamid Tebyanian",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "Communications Physics volume 5, 273 (2022)",
      "year": 2020,
      "volume": "",
      "pages": "",
      "doi": "10.1038/s42005-022-01038-3",
      "arxiv_id": "2010.05798",
      "url": "https://arxiv.org/abs/2010.05798",
      "abstract": "Randomness is a central feature of quantum mechanics and an invaluable resource for both classical and quantum technologies. Commonly, in Device-Independent and Semi-Device-Independent scenarios, randomness is certified using projective measurements and the amount of certified randomness is bounded by the dimension of the measured quantum system. In this work, we propose a new Source-Device-Independent protocol, based on Positive Operator Valued Measurement (POVM), which can arbitrarily increase the number of certified bits for any fixed dimension. A tight lower-bound on the quantum conditional min-entropy is derived using only the POVM structure and the experimental expectation values, taking into account the quantum side-information. For symmetrical POVM measurements on the Bloch sphere we have derived closed-form analytical bounds. Finally, we experimentally demonstrate our method with a compact and simple photonic setup that employs polarization-encoded qubits and POVM up to 6 outcomes.",
      "type": "journal",
      "venue": "Communications Physics volume 5, 273 (2022)",
      "pdf_url": "https://arxiv.org/pdf/2010.05798.pdf",
      "bibtex": ""
    },
    {
      "title": "All-fiber self-compensating polarization encoder for Quantum Key Distribution",
      "authors": [
        "Costantino Agnesi",
        "Marco Avesani",
        "Andrea Stanco",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "Optics Letters Vol. 44, Issue 10, pp. 2398-2401 (2019)",
      "year": 2019,
      "volume": "",
      "pages": "",
      "doi": "10.1364/OL.44.002398",
      "arxiv_id": "1903.00696",
      "url": "https://arxiv.org/abs/1903.00696",
      "abstract": "Quantum Key Distribution (QKD) allows distant parties to exchange cryptographic keys with unconditional security by encoding information on the degrees of freedom of photons. Polarization encoding has been extensively used in QKD implementations along free-space, optical fiber and satellite-based links. However, the polarization encoders used in such implementations are unstable, expensive, complex and can even exhibit side-channels that undermine the security of the implemented protocol. Here we propose a self-compensating polarization encoder based on a Lithium Niobate phase modulator inside a Sagnac interferometer and implement it using only standard telecommunication commercial off-the-shelves components (COTS). Our polarization encoder combines a simple design and high stability reaching an intrinsic quantum bit error rate as low as 0.2%. Since realization is possible from the 800 nm to the 1550 nm band by using COTS, our polarization modulator is a promising solution for free-space, fiber and satellite-based QKD.",
      "type": "journal",
      "venue": "Optics Letters Vol. 44, Issue 10, pp. 2398-2401 (2019)",
      "pdf_url": "https://arxiv.org/pdf/1903.00696.pdf",
      "bibtex": ""
    },
    {
      "title": "Fast and simple qubit-based synchronization for quantum key distribution",
      "authors": [
        "Luca Calderaro",
        "Andrea Stanco",
        "Costantino Agnesi",
        "Marco Avesani",
        "Daniele Dequal",
        "Paolo Villoresi",
        "Giuseppe Vallone"
      ],
      "journal": "Phys. Rev. Applied 13, 054041 (2020)",
      "year": 2019,
      "volume": "",
      "pages": "",
      "doi": "10.1103/PhysRevApplied.13.054041",
      "arxiv_id": "1909.12050",
      "url": "https://arxiv.org/abs/1909.12050",
      "abstract": "We propose Qubit4Sync, a synchronization method for Quantum Key Distribution (QKD) setups, based on the same qubits exchanged during the protocol and without requiring additional hardware other than the one necessary to prepare and measure the quantum states. Our approach introduces a new cross-correlation algorithm achieving the lowest computational complexity, to our knowledge, for high channel losses. We tested the robustness of our scheme in a real QKD implementation.",
      "type": "journal",
      "venue": "Phys. Rev. Applied 13, 054041 (2020)",
      "pdf_url": "https://arxiv.org/pdf/1909.12050.pdf",
      "bibtex": ""
    },
    {
      "title": "Practical and secure quantum randomness generation and communication",
      "authors": [],
      "journal": "",
      "year": 2019,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "",
      "url": "",
      "abstract": "",
      "type": "journal",
      "venue": "",
      "pdf_url": "",
      "bibtex": ""
    },
    {
      "title": "Simple Quantum Key Distribution with qubit-based synchronization and a self-compensating polarization encoder",
      "authors": [
        "Costantino Agnesi",
        "Marco Avesani",
        "Luca Calderaro",
        "Andrea Stanco",
        "Giulio Foletto",
        "Mujtaba Zahidy",
        "Alessia Scriminich",
        "Francesco Vedovato",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Optica 7, 284 (2020)",
      "year": 2019,
      "volume": "",
      "pages": "",
      "doi": "10.1364/OPTICA.381013",
      "arxiv_id": "1909.12703",
      "url": "https://arxiv.org/abs/1909.12703",
      "abstract": "Quantum Key Distribution (QKD) relies on quantum communication to allow distant parties to share a secure cryptographic key. Widespread adoption of QKD in current telecommunication networks will require the development of simple, low cost and stable systems. However, current QKD implementations usually include additional hardware that perform auxiliary tasks such as temporal synchronization and polarization basis tracking. Here we present a polarization-based QKD system operating at 1550 nm that performs synchronization and polarization compensation by exploiting only the hardware already needed for the quantum communication task. Polarization encoding is performed by a self-compensating Sagnac loop modulator which exhibits high temporal stability and the lowest intrinsic quantum bit error rate reported so far.The QKD system was tested over a fiber-optic link, demonstrating tolerance up to about 40 dB of channel losses. Thanks to its reduced hardware requirements and the quality of the source, this work represents an important step towards technologically mature QKD systems.",
      "type": "journal",
      "venue": "Optica 7, 284 (2020)",
      "pdf_url": "https://arxiv.org/pdf/1909.12703.pdf",
      "bibtex": ""
    },
    {
      "title": "Postselection-loophole-free Bell violation with genuine time-bin entanglement",
      "authors": [
        "Francesco Vedovato",
        "Costantino Agnesi",
        "Marco Tomasin",
        "Marco Avesani",
        "Jan-Åke Larsson",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Phys. Rev. Lett. 121, 190401 (2018)",
      "year": 2018,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "1804.10150",
      "url": "https://arxiv.org/abs/1804.10150",
      "abstract": "Entanglement is an invaluable resource for fundamental tests of physics and the implementation of quantum information protocols such as device-independent secure communications. In particular, time-bin entanglement is widely exploited to reach these purposes both in free-space and optical fiber propagation, due to the robustness and simplicity of its implementation. However, all existing realizations of time-bin entanglement suffer from an intrinsic postselection loophole, which undermines their usefulness. Here, we report the first experimental violation of Bell's inequality with \"genuine\" time-bin entanglement, free of the postselection loophole. We introduced a novel function of the interferometers at the two measurement stations, that operate as fast synchronized optical switches. This scheme allowed to obtain a postselection-loophole-free Bell violation of more than nine standard deviations. Since our scheme is fully implementable using standard fiber-based components and is compatible with modern integrated photonics, our results pave the way for the distribution of genuine time-bin entanglement over long distances.",
      "type": "journal",
      "venue": "Phys. Rev. Lett. 121, 190401 (2018)",
      "pdf_url": "https://arxiv.org/pdf/1804.10150.pdf",
      "bibtex": ""
    },
    {
      "title": "Secure heterodyne-based quantum random number generator at 17 Gbps",
      "authors": [
        "Marco Avesani",
        "Davide G. Marangon",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Nature Communications 9, 5365 (2018)",
      "year": 2018,
      "volume": "",
      "pages": "",
      "doi": "",
      "arxiv_id": "1801.04139",
      "url": "https://arxiv.org/abs/1801.04139",
      "abstract": "Random numbers are commonly used in many different fields, ranging from simulations in fundamental science to security applications. In some critical cases, as Bell's tests and cryptography, the random numbers are required to be both secure (i.e. known only by the legitimate user) and to be provided at an ultra-fast rate (i.e. larger than Gbit/s). However, practical generators are usually considered trusted, but their security can be compromised in case of imperfections or malicious external actions. In this work we introduce an efficient protocol which guarantees security and speed in the generation. We propose a novel source-device-independent protocol based on generic Positive Operator Valued Measurements and then we specialize the result to heterodyne measurements. The security of the generated numbers is proven without any assumption on the source, which can be even fully controlled by an adversary. Furthermore, we experimentally implemented the protocol by exploiting heterodyne measurements, reaching an unprecedented secure generation rate of 17.42 Gbit/s, without the need to take into account finite-size effects. Our device combines simplicity, ultrafast-rates and high security with low cost components, paving the way to new practical solutions for random number generation.",
      "type": "journal",
      "venue": "Nature Communications 9, 5365 (2018)",
      "pdf_url": "https://arxiv.org/pdf/1801.04139.pdf",
      "bibtex": ""
    },
    {
      "title": "Source-device-independent heterodyne-based quantum random number generator at 17 Gbps",
      "authors": [
        "Marco Avesani",
        "Davide G. Marangon",
        "Giuseppe Vallone",
        "Paolo Villoresi"
      ],
      "journal": "Nature Communications",
      "year": 2018,
      "volume": "",
      "pages": "",
      "doi": "10.1038/s41467-018-07585-0",
      "arxiv_id": "",
      "url": "https://doi.org/10.1038/s41467-018-07585-0",
      "abstract": "",
      "type": "journal",
      "venue": "Nature Communications",
      "pdf_url": "",
      "bibtex": ""
    }
  ]
}